public class Main {
    public static void main(String[] args) {

        // Задание №1
        byte y = 35;
        if (y >= 18) {
            System.out.println("Если возраст человека равен " + y + " ,то он совершеннолетний");
        }
        else {
            System.out.println("Если возраст человека равен " + y
                    + " ,то он не достиг совершеннолетния, нужно немного подождать ");
        }
    }
}